InformationRegisters/Взаимодействия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>Взаимодействия</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодВзаимодействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаОтветственного</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипВзаимодействия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВзаимодействий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Запрос</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВзаимодействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыВзаимодействий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АктивностьВзаимодействия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипАктивностиВзаимодействия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Контакт</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтактВзаимодействия</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтактыСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Офис</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоПроведенияВстречи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МестаПроведенияВстреч</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипОбъектаНедвижимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФормыОплатыСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Взаимодействие</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ТелефонныйЗвонок</v8:Type>
						<v8:Type>cfg:DocumentRef.Встреча</v8:Type>
						<v8:Type>cfg:DocumentRef.СообщениеSMS</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СоответствиеГруппПользователейОфисам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеГруппПользователейОфисам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ГруппаПользователей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Офис</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыВзаимодействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ТипыВзаимодействий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Встреча</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТелефонныйЗвонок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронноеПисьмоВходящее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронноеПисьмоИсходящее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщениеSMS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сделка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расторжение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыВзаимодействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>СтатусыВзаимодействий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Завершено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запланировано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОбъектовНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ВидыОбъектовНедвижимости</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЖилаяНедвижимость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоммерческаяНедвижимость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НежилаяНедвижимость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗемельныйУчасток</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Машиноместо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ТелефонныйЗвонок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>ТелефонныйЗвонок</Name>
			<BasedOn>
				<xr:Item>Document.Встреча</xr:Item>
				<xr:Item>Document.ТелефонныйЗвонок</xr:Item>
				<xr:Item>Document.ЭлектронноеПисьмоВходящее</xr:Item>
				<xr:Item>Document.ЭлектронноеПисьмоИсходящее</xr:Item>
				<xr:Item>Document.ЗапланированноеВзаимодействие</xr:Item>
				<xr:Item>Document.СообщениеSMS</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АбонентКакСвязаться</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбонентКонтакт</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтактВзаимодействия</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбонентПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВажностиВзаимодействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзаимодействиеОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗапланированноеВзаимодействие</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ТелефонныйЗвонок</v8:Type>
						<v8:Type>cfg:DocumentRef.Встреча</v8:Type>
						<v8:Type>cfg:DocumentRef.СообщениеSMS</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Входящий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отменено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удалить_Рассмотрено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удалить_РассмотретьПосле</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПредмет</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПредметВзаимодействия</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗапроса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗапроса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасшифровкаСтатусаЗапроса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныСтатусовЗапроса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/Взаимодействия/Forms/ПланироварниеПереговоров/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Ответственный = ПользователиКлиентСервер.АвторизованныйПользователь();
	
	ЭтоМенеджерГПТ = УправлениеДоступом.ЕстьРоль("МенеджерГПТ", , Ответственный); 
	ЭтоМенеджерФилиала = УправлениеДоступом.ЕстьРоль("МенеджерФилиала", , Ответственный);
	
	Если Параметры.Свойство("ДанныеУчастника") Тогда
		АдресДанныхУчастника = ПоместитьВоВременноеХранилище(Параметры.ДанныеУчастника, УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗвонок(Команда)
		
	ОписаниеОповещенияОЗакрытииДопФормВзаимодействий = Новый ОписаниеОповещения("ЗавершениеЗакрытияДопФормВзаимодействий", ЭтотОбъект);
	ПараметрыОткрытияФормы = ПодготовитьПараметрыОткрытияФормы(Параметры.Предмет, Параметры.Проект, ?(ЭтоАдресВременногоХранилища(АдресДанныхУчастника), ПолучитьИзВременногоХранилища(АдресДанныхУчастника), Неопределено), "Документ.ТелефонныйЗвонок.Форма.ФормаДокумента_Нов", ЭтоМенеджерГПТ, ЭтоМенеджерФилиала);	
	
	Если ПараметрыОткрытияФормы.ВзаимодействияДляОткрытия.Количество() Тогда
		Для каждого Взаимодействие Из ПараметрыОткрытияФормы.ВзаимодействияДляОткрытия Цикл	
			//ПоказатьЗначение(ОписаниеОповещенияОЗакрытииДопФормВзаимодействий, Взаимодействие);
			ФормаВзаимодействия = ?(ТипЗнч(Взаимодействие) = Тип("ДокументСсылка.Встреча"), "Документ.Встреча.ФормаОбъекта", "Документ.ТелефонныйЗвонок.ФормаОбъекта"); 
			ПараметрыФормы = Новый Структура("Ключ", Взаимодействие);
			ОткрытьФорму(ФормаВзаимодействия, , ЭтаФорма, Истина, , , ОписаниеОповещенияОЗакрытииДопФормВзаимодействий, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);			
		КонецЦикла;
	Иначе
		Если ЗначениеЗаполнено(ПараметрыОткрытияФормы.ФормаВзаимодействия) Тогда
			ОткрытьФорму(ПараметрыОткрытияФормы.ФормаВзаимодействия, ПараметрыОткрытияФормы.ПараметрыНовогоВзаимодействия, ЭтаФорма, Истина, , , ОписаниеОповещенияОЗакрытииДопФормВзаимодействий, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьВстречу(Команда)
	
	ОписаниеОповещенияОЗакрытииДопФормВзаимодействий = Новый ОписаниеОповещения("ЗавершениеЗакрытияДопФормВзаимодействий", ЭтотОбъект);	
	ПараметрыОткрытияФормы = ПодготовитьПараметрыОткрытияФормы(Параметры.Предмет, Параметры.Проект, ?(ЭтоАдресВременногоХранилища(АдресДанныхУчастника), ПолучитьИзВременногоХранилища(АдресДанныхУчастника), Неопределено), "Документ.Встреча.ФормаОбъекта", ЭтоМенеджерГПТ, ЭтоМенеджерФилиала);	
	
	Если ПараметрыОткрытияФормы.ВзаимодействияДляОткрытия.Количество() Тогда
		Для каждого Взаимодействие Из ПараметрыОткрытияФормы.ВзаимодействияДляОткрытия Цикл	
			//ПоказатьЗначение(ОписаниеОповещенияОЗакрытииДопФормВзаимодействий, Взаимодействие);	
			ФормаВзаимодействия = ?(ТипЗнч(Взаимодействие) = Тип("ДокументСсылка.Встреча"), "Документ.Встреча.ФормаОбъекта", "Документ.ТелефонныйЗвонок.ФормаОбъекта"); 
			ПараметрыФормы = Новый Структура("Ключ", Взаимодействие);
			ОткрытьФорму(ФормаВзаимодействия, , ЭтаФорма, Истина, , , ОписаниеОповещенияОЗакрытииДопФормВзаимодействий, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);			
		КонецЦикла;
	Иначе
		Если ЗначениеЗаполнено(ПараметрыОткрытияФормы.ФормаВзаимодействия) Тогда
			ОткрытьФорму(ПараметрыОткрытияФормы.ФормаВзаимодействия, ПараметрыОткрытияФормы.ПараметрыНовогоВзаимодействия, ЭтаФорма, Истина, , , ОписаниеОповещенияОЗакрытииДопФормВзаимодействий, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура Скрыть(Команда)
	Закрыть();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПодготовитьПараметрыОткрытияФормы(Предмет, Проект, ДанныеУчастника, ФормаВзаимодействия, МенеджерГПТ, МенеджерФилиала)
	
	ВзаимодействияДляОткрытия = Новый Массив;
	ПараметрыНовогоВзаимодействия = Неопределено;	
		
	Если МенеджерГПТ Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СоставыГруппПользователей.Пользователь КАК Пользователь
		|ПОМЕСТИТЬ ВТ_ПользователиГПТ
		|ИЗ
		|	РегистрСведений.СоставыГруппПользователей КАК СоставыГруппПользователей
		|ГДЕ
		|	СоставыГруппПользователей.ГруппаПользователей.Наименование = ""ГПТ""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Взаимодействия.Взаимодействие КАК Взаимодействие
		|ИЗ
		|	РегистрСведений.Взаимодействия КАК Взаимодействия
		|ГДЕ
		|	Взаимодействия.Предмет = &Предмет
		|	И Взаимодействия.ТипВзаимодействия = &ТипВзаимодействия
		|	И Взаимодействия.Статус = &Статус
		|	И ВЫБОР
		|			КОГДА НЕ Взаимодействия.Взаимодействие ССЫЛКА Справочник.Сделки
		|				ТОГДА Взаимодействия.Взаимодействие.Автор В
		|						(ВЫБРАТЬ
		|							ВТ_ПользователиГПТ.Пользователь КАК Пользователь
		|						ИЗ
		|							ВТ_ПользователиГПТ КАК ВТ_ПользователиГПТ)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";

		Запрос.УстановитьПараметр("Предмет", Предмет);
		Запрос.УстановитьПараметр("ТипВзаимодействия", ?(СтрНайти(ФормаВзаимодействия, "ТелефонныйЗвонок"), Перечисления.ТипыВзаимодействий.ТелефонныйЗвонок, Перечисления.ТипыВзаимодействий.Встреча));
		Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыВзаимодействий.Запланировано);
		Запрос.УстановитьПараметр("ГруппаОтветственного", Справочники.ГруппыПользователей.НайтиПоНаименованию("ГПТ"));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ВзаимодействияДляОткрытия.Добавить(ВыборкаДетальныеЗаписи.Взаимодействие);
		КонецЦикла;
		
		Если НЕ ВзаимодействияДляОткрытия.Количество() Тогда		
			Если СтрНайти(ФормаВзаимодействия, "Встреча") Тогда					
				Офис = "";
				ВидНедвижимости = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Проект, "ВидНедвижимости");
				Если ВидНедвижимости = Перечисления.ВидыОбъектовНедвижимости.ЖилаяНедвижимость Тогда
					Офис = "Филиал";	
				ИначеЕсли ВидНедвижимости = Перечисления.ВидыОбъектовНедвижимости.ЗемельныйУчасток Тогда
					Офис = "Экскурсия";	
				КонецЕсли;
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	СоответствиеГруппПользователейОфисам.ГруппаПользователей КАК Ответственный
				|ИЗ
				|	РегистрСведений.СоответствиеГруппПользователейОфисам КАК СоответствиеГруппПользователейОфисам
				|ГДЕ
				|	СоответствиеГруппПользователейОфисам.Офис = &Офис
				|	И СоответствиеГруппПользователейОфисам.Проект = &Проект
				|	И СоответствиеГруппПользователейОфисам.ГруппаПользователей В ИЕРАРХИИ(&ГруппаРодитель)
				|	И НЕ СоответствиеГруппПользователейОфисам.ГруппаПользователей.ПометкаУдаления
				|
				|УПОРЯДОЧИТЬ ПО
				|	СоответствиеГруппПользователейОфисам.ГруппаПользователей.Наименование";
				
				Запрос.УстановитьПараметр("Офис", Офис);
				Запрос.УстановитьПараметр("Проект", Проект);
				Запрос.УстановитьПараметр("ГруппаРодитель", ?(Офис = "Экскурсия", Справочники.ГруппыПользователей.НайтиПоНаименованию("Земля розница", Истина), Справочники.ГруппыПользователей.НайтиПоНаименованию("Филиал", Истина)));
				
				РезультатЗапроса = Запрос.Выполнить();			
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();			
				Если ВыборкаДетальныеЗаписи.Следующий() Тогда
					Ответственный = ВыборкаДетальныеЗаписи.Ответственный;
				КонецЕсли;	
				
				ПараметрыНовогоВзаимодействия = Новый Структура("Предмет, Ответственный, Офис, ДанныеУчастника", Предмет, Ответственный, Офис, ДанныеУчастника);
			ИначеЕсли СтрНайти(ФормаВзаимодействия, "ТелефонныйЗвонок") Тогда
				ПараметрыНовогоВзаимодействия = Новый Структура("Предмет, Ответственный, ДанныеУчастника", Предмет, Пользователи.ТекущийПользователь(), ДанныеУчастника);	
			КонецЕсли;
		КонецЕсли;
	Иначе		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Взаимодействия.Взаимодействие КАК Взаимодействие
		|ИЗ
		|	РегистрСведений.Взаимодействия КАК Взаимодействия
		|ГДЕ
		|	Взаимодействия.Предмет = &Предмет
		|	И Взаимодействия.ТипВзаимодействия = &ТипВзаимодействия
		|	И Взаимодействия.Статус = &Статус
		|	И ВЫБОР
		|			КОГДА НЕ Взаимодействия.Взаимодействие ССЫЛКА Справочник.Сделки
		|				ТОГДА Взаимодействия.Взаимодействие.Автор В ИЕРАРХИИ (&ГруппаОтветственного)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
		
		Запрос.УстановитьПараметр("Предмет", Предмет);
		Запрос.УстановитьПараметр("ТипВзаимодействия", ?(СтрНайти(ФормаВзаимодействия, "ТелефонныйЗвонок"), Перечисления.ТипыВзаимодействий.ТелефонныйЗвонок, Перечисления.ТипыВзаимодействий.Встреча));
		Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыВзаимодействий.Запланировано);
		Запрос.УстановитьПараметр("ГруппаОтветственного", РегистрыСведений.Взаимодействия.ПолучитьГруппуОтветственного(Пользователи.ТекущийПользователь(), ТекущаяДата()));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ВзаимодействияДляОткрытия.Добавить(ВыборкаДетальныеЗаписи.Взаимодействие);
		КонецЦикла;
		
		Если НЕ ВзаимодействияДляОткрытия.Количество() Тогда		
			Если СтрНайти(ФормаВзаимодействия, "Встреча") Тогда					
				Офис = "";
				ВидНедвижимости = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Проект, "ВидНедвижимости");
				Если ВидНедвижимости = Перечисления.ВидыОбъектовНедвижимости.ЖилаяНедвижимость Тогда
					Офис = "Филиал";	
				ИначеЕсли ВидНедвижимости = Перечисления.ВидыОбъектовНедвижимости.ЗемельныйУчасток Тогда
					Офис = "Экскурсия";	
				КонецЕсли;
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	СоответствиеГруппПользователейОфисам.ГруппаПользователей КАК Ответственный
				|ИЗ
				|	РегистрСведений.СоответствиеГруппПользователейОфисам КАК СоответствиеГруппПользователейОфисам
				|ГДЕ
				|	СоответствиеГруппПользователейОфисам.Офис = &Офис
				|	И СоответствиеГруппПользователейОфисам.Проект = &Проект
				|	И СоответствиеГруппПользователейОфисам.ГруппаПользователей В ИЕРАРХИИ(&ГруппаРодитель)
				|	И НЕ СоответствиеГруппПользователейОфисам.ГруппаПользователей.ПометкаУдаления
				|
				|УПОРЯДОЧИТЬ ПО
				|	СоответствиеГруппПользователейОфисам.ГруппаПользователей.Наименование";
				
				Запрос.УстановитьПараметр("Офис", Офис);
				Запрос.УстановитьПараметр("Проект", Проект);					
				Запрос.УстановитьПараметр("ГруппаРодитель", ?(Офис = "Экскурсия", Справочники.ГруппыПользователей.НайтиПоНаименованию("Земля розница", Истина), Справочники.ГруппыПользователей.НайтиПоНаименованию("Филиал", Истина)));
				
				РезультатЗапроса = Запрос.Выполнить();			
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();			
				Если ВыборкаДетальныеЗаписи.Следующий() Тогда
					ГруппаОтветственного = ВыборкаДетальныеЗаписи.Ответственный;
				КонецЕсли;				
								
				ПараметрыНовогоВзаимодействия = Новый Структура("Предмет, Ответственный, ГруппаОтветственного, Офис, ДанныеУчастника", Предмет, Пользователи.ТекущийПользователь(), ГруппаОтветственного, Офис, ДанныеУчастника);
			ИначеЕсли СтрНайти(ФормаВзаимодействия, "ТелефонныйЗвонок") Тогда
				ПараметрыНовогоВзаимодействия = Новый Структура("Предмет, Ответственный, ДанныеУчастника", Предмет, Пользователи.ТекущийПользователь(), ДанныеУчастника);	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
			
	Возврат Новый Структура("ФормаВзаимодействия, ПараметрыНовогоВзаимодействия, ВзаимодействияДляОткрытия", ФормаВзаимодействия, ПараметрыНовогоВзаимодействия, ВзаимодействияДляОткрытия);
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеЗакрытияДопФормВзаимодействий(Результат, ДополнительныеПараметры) Экспорт	
	
	Если ЭтаФорма.Открыта() Тогда
		Закрыть();			
	КонецЕсли;
	
КонецПроцедуры
